<script>
import { Line } from 'vue-chartjs'

export default {
  extends: Line,
  props: {
    // chartData: {
    //   type: Array,
    //   default: null
    // },
    chartOptions: {
      type: Object,
      default: null
    }
  },
  data: () => ({
    chartData: {
      labels: ['01.02.2022', '02.02.2022', '03.02.2022', '04.02.2022', '05.02.2022', '06.02.2022', '07.02.2022', '08.02.2022', '09.02.2022', '10.02.2022', '11.02.2022', '12.02.2022', '13.02.2022', '14.02.2022', '15.02.2022', '16.02.2022', '17.02.2022', '18.02.2022', '19.02.2022', '20.02.2022', '21.02.2022', '22.02.2022', '23.02.2022', '24.02.2022', '25.02.2022'],
      datasets: [
        {
          label: 'Общее количество запросов по датам',
          backgroundColor: 'rgba(0,9,199,0.5)',
          data: [867, 521, 589, 526, 326, 708, 823, 366, 975, 342, 321, 113, 801, 778, 724, 176, 783, 601, 286, 847, 405, 508, 714, 876, 590]
        }
      ]
    }
  }),
  mounted () {
    this.renderChart(this.chartData, this.chartOptions)
  }
}
</script>
